<?
# подключение файла с настройками конфигурации
require("core/config.php");
# устанавливаем временной пояс
date_default_timezone_set("Europe/Moscow");
# подключение файла с функциями
require("core/function.php");
# подключение файла осуществляющего связь с базой данных
require("core/connect.php");

if (isset($_GET['vk'])) {

###################################################################################################
# начало, определение ip-адреса посетителя ########################################################
###################################################################################################
function ip_what() {
if (getenv('HTTP_X_FORWARDED_FOR')) {
$ip=getenv('HTTP_X_FORWARDED_FOR');
} else {
$ip=getenv('REMOTE_ADDR');
 }
return $ip;
}
###################################################################################################
# конец, определение ip-адреса посетителя #########################################################
###################################################################################################

###################################################################################################
### начало, защита от частых запросов на создание аватарок ########################################
###################################################################################################

# файл с временными метками доступа
$file_access = "/var/www/antiddos/blocked/ava_".ip_what();
# время блокировки, сек
$blocked_time = 60;
# количество повторов(начало)
$count_time_num = 0;

# если файл существует
if (file_exists($file_access)) {
# содержимое файла в массив
$file_arr = file($file_access);

# признак блокировки
if ($file_arr[0]=="blocked") {
# время последнего редактирования файла
$time_edit = filemtime($file_access);

# если еще не прошло время блокировки
if ($time_edit + $blocked_time >= time()) {
exit;
 } else {
# очищаем файл
file_put_contents($file_access, "");
 }
}

# массив повторов меток времени
$count_time = array_count_values($file_arr);

# выбираем только первый элемент
foreach($count_time as $key => $value) {
$count_time_num = $value;
break;
}

if (count(array_count_values($file_arr)) > 2) {
# очищаем файл
file_put_contents($file_access, "");
 }
}

# количество повторов временных меток (т.е в одну секунду сколько запросов)
if ($count_time_num >= 4) {
# очищаем файл и ставим метку "заблокирован"
$blocked = fopen($file_access, "w");
fwrite($blocked, "blocked");
fclose($blocked);
chmod($file_access, 0777);
} else {
# записываем показатели счетчика
$t=fopen($file_access, "a");
fwrite($t, time()."\r\n");
fclose($t);
chmod($file_access, 0777);
}
###################################################################################################
### конец, защита от частых запросов на создание аватарок #########################################
###################################################################################################

# определяем id_vk_user пользователя
$id_vk_user = convert_post($_GET['vk'], "0");

# проверяем, существует ли такой пользователь
$monitoring_user_query=mysql_query("select * from vkontakte_user_to_monitoring where id_vk_user='$id_vk_user'");

# проверка на существование такого id в базе
if (!mysql_num_rows($monitoring_user_query)) {
# выводим аватарку с неизвестным пользователем
$avatar_exist_bg=imagecreatefrompng("/var/www/templates/".name_template_project."/index/images/is_not.png");
} else {

# получаем данные этого пользователя
$vk_user_data=mysql_fetch_assoc($monitoring_user_query);

###################################################################################################
### начало, получение загруженной аватарки ########################################################
###################################################################################################
$content_img_path_vk=explode("/", $vk_user_data["avatar_vk_user"]);
$img_name_vk=$content_img_path_vk[count($content_img_path_vk)-1];
$avatar_exist_path = "/var/www/core/vkontakte/avatars/".$img_name_vk;

# получаем данные закачанной аватарки
$avatar_exist_data=getimagesize($avatar_exist_path);
# создаем изображение из данной фотографии в зависимости от типа файла
if ($avatar_exist_data[2]==1) {
$avatar_exist_image = imagecreatefromgif($avatar_exist_path);
} elseif ($avatar_exist_data[2]==2) {
$avatar_exist_image = imagecreatefromjpeg($avatar_exist_path);
}
###################################################################################################
### конец, получение загруженной аватарки #########################################################
###################################################################################################

###################################################################################################
### начало, создаем фон для аватарки ##############################################################
###################################################################################################

# получаем данные фона онлайн/оффлайн
if (is_online($id_vk_user, 0)) {
$avatar_exist_bg=imagecreatefrompng("/var/www/templates/".name_template_project."/index/images/is_online.png");
} else {
$avatar_exist_bg=imagecreatefrompng("/var/www/templates/".name_template_project."/index/images/is_offline.png");
}
###################################################################################################
### конец, создаем фон для аватарки ###############################################################
###################################################################################################


# создаем из двух изображений одно
imagecopy(
	     $avatar_exist_bg,
	     $avatar_exist_image,
         8,  # x - координата вставки в конечную область
         39, # y - координата вставки в конечную область
         0,  # x - координата копируемой области
         0,  # y - координата копируемой области
         50, # ширина копируемой области
         50  # высота копируемой области
         );
}
# для вывода png аватарки
header ("Content-type: image/png");
# конечная аватарка
imagepng($avatar_exist_bg);
imagedestroy($avatar_exist_bg);
}
?>